dastin-alex/esp8266_test/src/main.cpp
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ------------------------------------------------------------------------------------------------- module
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// --             "main"                                                                                 --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ---------------------------------------------------------------------------------------------- component
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// -- title       : esp8266_test                                                                         --
// -- version     : 2.0                                                                                  --
// -- framework   : arduino                                                                              --
// -- author      : goldobin a.                                                                          --
// -- company     : cardboard.ru                                                                         --
// -- data        : 08/09/2022                                                                           --
// --                                                                                                    --
// --                                                                                                    --
// -- description :                                                                                      --
// --                                                                                                    --
// --                                                                                                    --
// --             (1) осуществляется ОДНОВРЕМЕННОЕ выполнение трёх потоков задач                         --
// --                 каждому потоку задач соответствует отдельный ПРОЦЕСС                               --
// --                                                                                                    --
// --                 BL (blink)    - непрерывная световая сигнализация                                  --
// --                 KP (keypress) - контроль нажатия встроенной кнопки                                 --
// --                 TS (timescan) - периодический вывод в UART значения времени                        --
// --                                                                                                    --
// --             (2) BL (blink) - это ПРОЦЕСС непрерывной световой сигнализации.                        --
// --                 для сигнализации используется единственный встроенный светодиод LED_BUILTIN.       --
// --                 бесконечно исполняемый цикл описывается таблицей                                   --
// --                                                                                                    --
// --                 Задача       Интервал        LED_BUILTIN                                           --
// --                 BL01         20 мс           HIGH                                                  --
// --                 BL02         300 мс          LOW                                                   --
// --                 BL03         20 мс           HIGH                                                  --
// --                 BL04         300 мс          LOW                                                   --
// --                 BL05         500 мс          HIGH                                                  --
// --                 BL06         500 мс          LOW                                                   --
// --                 BL07         500 мс          HIGH                                                  --
// --                 BL08         500 мс          LOW                                                   --
// --                                                                                                    --
// --             (3) задача BL00 исполняются однократно.                                                --
// --                 поток задач BL01 .. BL08 исполняются непрерывно.                                   --
// --                                                                                                    --
// --             (4) TS (timescan) - это ПРОЦЕСС периодического вывода в UART значения времени.         --
// --                 Клиент UDP/NTP. Считывание значения времени на сервере по протоколу NTP.           --
// --                 Обмен осуществляется с помощью сетевых пакетов UDP.                                --
// --                 Подробная справка о серверах времени NTP и необходимом формате сообщений           --
// --                 http://en.wikipedia.org/wiki/Network_Time_Protocol                                 --
// --                                                                                                    --
// --             (5) поток задач TS00 .. TS04 исполняются однократно.                                   --
// --                 поток задач TS05 .. TS07 исполняются непрерывно. через каждые 3 сек                --
// --                 выполняется алгоритм                                                               --
// --                                                                                                    --
// --             (6) не следует явно указывать IP-адрес, иначе нет преимуществ пула.                    --
// --                 вместо этого указывается IP-адрес, соответстующий имени хоста.                     --
// --                 пример явного задания IP-адреса (NTP сервер time.nist.gov):                        --
// --                 IPAddress timeServer(129, 6, 15, 28);                                              --
// --                                                                                                    --
// --             (7) KP (keypress) - контроль нажатия встроенной кнопки "FLASH"                         --
// --                 она подключена к земле GPIO0. её можно использовать как обычную кнопку.            --
// --                 если программно подтянуть вывод GPIO0 с помощью внутреннего подтягивающего         --
// --                 резистора к высокому уровню, то появление LOW на этом выводе означает НАЖАТИЕ.     --
// --                                                                                                    --
// --                 при коротком нажатии - в UART выводится строка "short click"                       --
// --                 при долгом нажатии   - в UART выводится строка "long click"                        --
// --                                                                                                    --
// --                 справка о контакте контроллера/платы для кнопки "FLASH"                            --
// --                 15 (IO0, GPIO0, SPICS2) - в режиме INPUT_PULLUP                                    --
// --                                                                                                    --
// --             (8) БИБЛИОТЕКИ, сопряжённые с проектом                                                 --
// --                                                                                                    --
// --                         Arduino.h                                                                  --
// --                         ESP8266WiFi.h                                                              --
// --                         WiFiUdp.h                                                                  --
// --                                                                                                    --
// --             (9) МЕТОДЫ, которые вызываются из сопряжённых с проектом библиотек                     --
// --                                                                                                    --
// --                         Serial.begin          начальная настройка модуля UART                      --
// --                         Serial.println        вывод строки в UART                                  --
// --                         Serial.print          вывод символов в UART                                --
// --                         WiFi.begin            регистрация в сети WIFI                              --
// --                         WiFi.mode             начальная настройка модуля WIFI                      --
// --                         WiFi.status           состояние соединения WiFi                            --
// --                         WiFi.scanNetworks     поиск активных точек подключения WIFI                --
// --                         WiFi.hostByName       выбор IP адреса хоста по имени                       --
// --                         WiFi.disconnect       отключение модуля WIFI                               --
// --                         udp.begin             начало работы с протоколом UDP                       --
// --                         udp.read              чтение кадра UDP                                     --
// --                         udp.write             запись данных в кадр UDP                             --
// --                         udp.beginPacket       начало кадра UDP                                     --
// --                         udp.endPacket         конец кадра UDP                                      --
// --                         udp.parsePacket       синтаксический разбор кадра UDP                      --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --------------------------------------------------------------------------------------------------------
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --

#include "esp8266_control.h"
#include "esp8266_test.h"

#define BUTTON 15
#define LED LED_BUILTIN

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS01
// включение, настройка UART
// начало печати отчёта. режим station mode модуля WiFi
// сканирование точек доступа WiFi.
// флаг no_wifi - количество имеющихся сетей
// ----------------------------------------------------------------------------

