dastin-alex/esp8266_test/src/main.cpp
int task_ts01()

{

  Serial.begin(9600); // МЕТОД Serial.begin : скорость 9600 бод
  Serial.println();   // МЕТОД Serial.println

  WiFi.mode(WIFI_STA);        // МЕТОД WiFi.mode  : режим station mode
  WiFi.disconnect();          // МЕТОД WiFi.disconnect : отключение модуля WIFI
  return WiFi.scanNetworks(); // МЕТОД WiFi.scanNetworks : поиск активных точек подключения WIFI
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS02
// печать отчёта в UART.
// перечисляются SSID имеющихся сетей WiFi.
// ----------------------------------------------------------------------------

void task_ts02(int attemp)

{

  if (!attemp)
  {

    Serial.println("no networks found"); // МЕТОД Serial.println
    WiFi.disconnect();                   // МЕТОД WiFi.disconnect : отключение модуля WIFI
  }

  else

    for (
        int i = 0;
        i < attemp;
        ++i)

    {

      Serial.print(i + 1);          // МЕТОД Serial.print : номер в списке
      Serial.print(" : ");          // МЕТОД Serial.print
      Serial.println(WiFi.SSID(i)); // МЕТОД Serial.println : значение i-ого WiFi.SSID
    }
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS31
// печать прогресса в UART.
// ---------------------------------------------------------------------- delay 500

int task_ts31(int cnt)

{

  --cnt;
  Serial.print("."); // МЕТОД Serial.print
  delay(500);
  return cnt;
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS03
// цикл опроса состояния соединения.
// ПОКА состояние соединения != WL_CONNECTED: ТО пауза ожидания 500
// ----------------------------------------------------------------------------

int task_ts03()

{

  int nc = 20;

  Serial.println();            // МЕТОД Serial.println
  Serial.print("connect to "); // МЕТОД Serial.print
  Serial.println(ssid);        // МЕТОД Serial.println : значение SSID

  WiFi.begin(ssid, pass); // МЕТОД WiFi.begin : регистрация в сети WIFI

  while (nc && (WiFi.status() != WL_CONNECTED)) // WiFi.status : состояние соединения

    nc = task_ts31(nc);

  Serial.println(); // МЕТОД Serial.println
  Serial.println(); // МЕТОД Serial.println
  return nc;
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS04
// печать отчёта в UART.
// информация о подключении к сети WIFI и настройке протокола UDP
// ----------------------------------------------------------------------------

void task_ts04(int nc)

{

  udp.begin(localPort); // МЕТОД udp.begin : начало работы с протоколом UDP

  if (!nc)
  {

    Serial.println();
    Serial.println("no WiFi connection"); // МЕТОД Serial.println
    WiFi.disconnect();                    // МЕТОД WiFi.disconnect : отключение модуля WIFI
  }

  else

  {

    Serial.println("");               // МЕТОД Serial.println
    Serial.println("WIFI connected"); // МЕТОД Serial.println
    Serial.print("IP address: ");     // МЕТОД Serial.print
    Serial.println(WiFi.localIP());   // МЕТОД Serial.println, WiFi.localIP
    Serial.print("Local port: ");     // МЕТОД Serial.print
    Serial.println(udp.localPort());  // МЕТОД Serial.println, udp.localPort
    Serial.println();                 // МЕТОД Serial.println
  }

  Serial.println(); // МЕТОД Serial.println
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS05
// подключение к сети WIFI.
// случайный выбор сервера из пула NTP
// начальная установка битовых полей пакета запроса времени NTP.
// установка необходимых байтов буфера пакета.
// байты 4 .. 11 (8 байтов) установлены в 0.
// отправка пакета NTP в выбранный сервер времени.
// используется порт 123.
// пауза ожидания ответа севера 1000
// ---------------------------------------------------------------------- delay 1000

void task_ts05()

{

  WiFi.hostByName(ntpServerName, timeServerIP); // МЕТОД WiFi.hostByName : выбор хоста по имени

  memset(packetBuffer, 0, NTP_PACKET_SIZE);

  packetBuffer[0] = 0b11100011; // LI, версия, режим
  packetBuffer[1] = 0;          // уровень или тип часов
  packetBuffer[2] = 6;          // интервал
  packetBuffer[3] = 0xEC;       // точность (Peer Clock Precision)

  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;

  udp.beginPacket(timeServerIP, 123);       // МЕТОД udp.beginPacket : начало кадра UDP
  udp.write(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.write : запись данных в кадр UDP
  udp.endPacket();                          // МЕТОД udp.endPacket : конец кадра UDP

  delay(1000);
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS06
// синтаксический разбор пакета, полученного из сети WIFI.
// ЕСЛИ длина пакета = 0  : ТО пакет UDP не принят
// ЕСЛИ длина пакета != 0 : ТО пакет UDP получен
// ----------------------------------------------------------------------------

int task_ts06(void)

{

  return udp.parsePacket(); // МЕТОД udp.parsePacket : синтаксический разбор кадра UDP
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TS07
// сохранение информации о времени из пакета в буфер.
// длина битового поля информации о времени равна четырем байтам.
// старшее слово - байты 40 .. 41 пакета
// младшее слов0 - байты 42 .. 43 пакета
// расчёт времени. число часов, минут, секунд времени GMT+3.
// время NTP     - количество секунд, прошедших с даты Jan 1 1900.
//                 одно четырёхбайтовое слово.
// время UNIX    - количество секунд, прошедших с даты Jan 1 1970.
//                 из времени NTP вычиется количество секунд в 70 годах.
// время GMT+3.  - соответствует времени UNIX в Москве.
//                 к времени UNIX прибавляется количество секунд в трёх часах
// печать в UART отчёта о времени. применяется формат HH:MM:SS
// время GMT     - соответствует меридиану Гринвича (Greenwich Meridian time).
// время GMT+3   - соответствует текущему времени в Москве.
// пауза ожидания 2 сек перед новым запросом времени.
// ---------------------------------------------------------------------- delay 2000

void task_ts07(int flag)

{

  unsigned long highWord;      // буфер хранения байтов 40,41 принятого пакета
  unsigned long lowWord;       // буфер хранения байтов 42,43 принятого пакета
  unsigned long secsSince1900; // время NTP. количество секунд, прошедших от даты Jan 1 1900
  unsigned long epoch;         // время UNIX. количество секунд, прошедших от даты Jan 1 1970
  unsigned long tdelta = 3;    // время GMT+3. количество часов смещения от GMT
  unsigned long gmt3;          // время GMT+3. время UNIX + смещение от GMT
  int thrs, tmin, tsec;        // время GMT+3. количество часов, минут, секунд

  if (flag)

  {
    udp.read(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.read : чтение кадра UDP

    highWord = word(packetBuffer[40], packetBuffer[41]);
    lowWord = word(packetBuffer[42], packetBuffer[43]);
    secsSince1900 = highWord << 16 | lowWord;

    epoch = secsSince1900 - seventyYears;
    gmt3 = epoch + tdelta * 3600;

    thrs = int((gmt3 % secsDay) / 3600);
    tmin = int((gmt3 % 3600) / 60);
    tsec = int(gmt3 % 60);

    Serial.print("NTP time   = ");   // МЕТОД Serial.print
    Serial.println(secsSince1900);   // МЕТОД Serial.println
    Serial.print("GMT time   = ");   // МЕТОД Serial.print
    Serial.println(epoch);           // МЕТОД Serial.println
    Serial.print("GMT+3 time = ");   // МЕТОД Serial.print
    Serial.println(gmt3);            // МЕТОД Serial.println
    Serial.print("Moscow time is "); // МЕТОД Serial.print

    if (thrs < 10)

      Serial.print('0'); // МЕТОД Serial.print

