dastin-alex/esp8266_test/src/main.cpp
    Serial.print(thrs); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    if (tmin < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.print(tmin); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    if (tsec < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.println(tsec); // МЕТОД Serial.println
    Serial.println();     // МЕТОД Serial.println
  }

  delay(2000);
}

// ----------------------------------------------------------------------------
//                                                                       МЕТОД
// начальная настройка подключения WiFi. печать отчёта в UART.
// ----------------------------------------------------------------------------

void esp8266_setup()

{

  task_ts02(task_ts01());
  task_ts04(task_ts03());
}

// ----------------------------------------------------------------------------
//                                                                       МЕТОД
// начальная настройка подключения WiFi. печать отчёта в UART.
// ----------------------------------------------------------------------------

void ntp_time()

{
  task_ts05();
  task_ts07(task_ts06());
}

void setup()

{

  pinMode(LED, OUTPUT);          // светодиод. режим OUTPUT
  pinMode(BUTTON, INPUT_PULLUP); // кнопка. режим INPUT_PULLUP

  esp8266_setup(); // начальная настройка подключения WiFi. печать отчёта в UART.
}

void loop()

{

  ntp_time();

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // управление встроенным светодиодом LED_BUILTIN
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------

  // static bool mode_led = false; // светодиод. переключение серий (0 - 30/600, 1 - 500/500)
  // static bool flag_led = false; // светодиод. только в серии 0. переключение интервалов
  // static int count_led = 0;     // светодиод. счётчик повторений в серии

  // if ((!mode_led && (count_led >= serial1_led)) || (mode_led && (count_led >= serial2_led)))

  // ----------------------------------------------------------------------------
  // обновление настроек
  // при достижении счётчиком серии предельного значения
  // ----------------------------------------------------------------------------

  // {
  //   mode_led = !mode_led;
  //   flag_led = false;
  //   count_led = 0;
  // }
  // else

  //     if (mode_led)

  // ----------------------------------------------------------------------------
  // серия 2
  // переключение состояния светодиода при mode_led = 1 (500/500)
  // ----------------------------------------------------------------------------

  // {
  //   if (millis() - tmr_led >= 500)
  //   {
  //     digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
  //     tmr_led = millis();
  //     count_led++;
  //   }
  // }

  // else

  // ----------------------------------------------------------------------------
  // серия 1
  // переключение состояния светодиода при mode_led = 0 (30/600)
  // ----------------------------------------------------------------------------

  // {
  //   if ((millis() - tmr_led) >= (flag_led ? 20 : 300))
  //   {
  //     digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
  //     tmr_led = millis();
  //     flag_led = !flag_led;
  //     count_led++;
  //   }
  // }

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // опрос, обработка состояния встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  // static uint32_t tmr_key;      // таймер кнопки
  // static bool flag_key = false; // кнопка. активация
  // static bool state_key;        // кнопка. состояние

  // state_key = !digitalRead(15); // кнопка. состояние

  // ----------------------------------------------------------------------------
  // нажатие кнопки
  // интервал 100 мс для защиты от дребезга
  // ----------------------------------------------------------------------------

  // if (state_key && !flag_key && millis() - tmr_key > 100)

  // {
  //  flag_key = true;
  //  tmr_key = millis();
  //  Serial.println("short click");
  // }

  // ----------------------------------------------------------------------------
  // нажатие кнопки
  // интервал 500 мс для контроля удержания
  // ----------------------------------------------------------------------------

  // if (state_key && flag_key && millis() - tmr_key > 500)

  //  Serial.println("long click");

  // ----------------------------------------------------------------------------
  // отпускание кнопки
  // интервал 100 мс для защиты от дребезга
  // ----------------------------------------------------------------------------

  // if (!state_key && flag_key && millis() - tmr_key > 100)

  // {
  //  flag_key = false;
  //  tmr_key = millis();
  // }
}
